html/jcip/executor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>任务执行</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="build_blocks.html"> UP </a>
 |
 <a accesskey="H" href="jcip.html"> HOME </a>
</div><div id="content">
<h1 class="title">任务执行</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge0da66f">线程中执行任务</a>
<ul>
<li><a href="#org4963f1e">串行执行</a></li>
<li><a href="#org0601a26">每个请求单独线程</a></li>
</ul>
</li>
<li><a href="#org2dc3b78">Executor框架</a>
<ul>
<li><a href="#org62628a6">线程执行策略</a></li>
<li><a href="#org8f11510">线程池</a></li>
<li><a href="#org8140dff">Executor生命周期：运行，关闭中，终止</a></li>
<li><a href="#org43dacfb">Timer和ScheduledThreadPool</a></li>
</ul>
</li>
<li><a href="#orgba2c938">发现可利用的并发</a>
<ul>
<li><a href="#org6189085">返回结果的任务　</a></li>
<li><a href="#org4d73d76">CompletionService</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge0da66f" class="outline-2">
<h2 id="orge0da66f">线程中执行任务</h2>
<div class="outline-text-2" id="text-orge0da66f">
</div>
<div id="outline-container-org4963f1e" class="outline-3">
<h3 id="org4963f1e">串行执行</h3>
<div class="outline-text-3" id="text-org4963f1e">
<p>
吞吐量低，响应慢，IO操作中浪费cpu
</p>
</div>
</div>

<div id="outline-container-org0601a26" class="outline-3">
<h3 id="org0601a26">每个请求单独线程</h3>
<div class="outline-text-3" id="text-org0601a26">
<ol class="org-ol">
<li>线程的创建和销毁会占用一定的资源。如果请求频繁而对请求的处理是轻量级的(大多的web请求符合该情形), 创建一个线程处理请求后将其销毁的方式是不划算的</li>
<li>过多的线程导致线程切换频繁, 用于处理请求的CPU时间反而会减少. 如果当前的线程数已经让CPU处于忙碌状态, 那么增加更多的线程不会改善应用的性能</li>
<li>过多的线程会导致系统稳定性下降　</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2dc3b78" class="outline-2">
<h2 id="org2dc3b78">Executor框架</h2>
<div class="outline-text-2" id="text-org2dc3b78">
<p>
将创建好的线程组织成线程池, 当请求来临时从池中取出线程处理请求, 处理完毕后将线程归还给线程池, 而不是销毁
</p>

<p>
通过限制线程池中的线程数, 以克服线程过多时性能和稳定性下降的缺陷 
</p>

<p>
Executor框架包含多个线程池的实现, 所有线程池都派生自Executor接口
 　
Executor接口只定义了一个方法: execute(Runnable task) 
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">interface</span> <span style="color: #98f5ff;">Executor</span> {
    <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">execute</span>(<span style="color: #98f5ff;">Runnable</span> <span style="color: #4eee94;">command</span>);
}
</pre>
</div>

<p>
Executor接口解耦了任务提交和任务执行, 提交任务的线程为生产者, 执行任务的线程为消费者 
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">TaskExecutionWebServer</span> {   
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">NTHREADS</span> = 100;   
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314;&#32447;&#31243;&#27744;  </span>
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Executor</span> <span style="color: #4eee94;">exec</span>   
    = Executors.newFixedThreadPool(NTHREADS);   

    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">main</span>(<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>) <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">IOException</span> {   
        <span style="color: #98f5ff;">ServerSocket</span> <span style="color: #4eee94;">socket</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">ServerSocket</span>(80);   
        <span style="color: #00bfff; font-weight: bold;">while</span> (<span style="color: #ffd700;">true</span>) {   
            <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Socket</span> <span style="color: #4eee94;">connection</span> = socket.accept();   
            <span style="color: #98f5ff;">Runnable</span> <span style="color: #4eee94;">task</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Runnable</span>() {   
                    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> run() {   
                        handleRequest(connection);   
                    }   
                };   
            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#23558;&#20219;&#21153;&#25552;&#20132;&#32473;&#32447;&#31243;&#27744;&#25191;&#34892;  </span>
            exec.execute(task);   
        }   
    }   
}  
</pre>
</div>

<p>
使用Executor实现每个请求一个线程
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">ThreadPerTaskExecutor</span> <span style="color: #00bfff; font-weight: bold;">implements</span> <span style="color: #98f5ff;">Executor</span> {
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">execute</span>(<span style="color: #98f5ff;">Runnable</span> <span style="color: #4eee94;">r</span>) {
        <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Thread</span>(r).start();
    };
}
</pre>
</div>
</div>

<div id="outline-container-org62628a6" class="outline-3">
<h3 id="org62628a6">线程执行策略</h3>
<div class="outline-text-3" id="text-org62628a6">
<ul class="org-ul">
<li>任务在哪个线程中执行</li>
<li>任务以何种顺序（FIFO, LIFO, 优先级）执行</li>
<li>同时有多少线程同步执行任务</li>
<li>多少任务可以等待执行</li>
<li>当负荷过载时候，那些任务可以被牺牲，如何通知应用这些任务</li>
<li>任务执行前和执行后需要哪些操作</li>
</ul>
</div>
</div>

<div id="outline-container-org8f11510" class="outline-3">
<h3 id="org8f11510">线程池</h3>
<div class="outline-text-3" id="text-org8f11510">
<p>
ExecutorService接口继承自Executor, 而预定义的线程池类大多实现了ExecutorService接口 
</p>
<ul class="org-ul">
<li>newFixedThreadPool: 最大线程数固定的线程池.</li>
<li>newCachedThreadPool: 可伸缩式线程池, 当线程池中线程的数量超过程序所需时, 会自动销毁多余的线程; 当线程池中的线程不能需要时再创建新的线程执行提交的任务, 该线程池没有最大线程数的限定</li>
<li>newSingleThreadExecutor: 仅包含一个线程的线程池, 提交给该线程池执行的任务, 都将在这一单个线程中完成处理</li>
<li>newScheduledThreadPool. 最大线程数固定且支持延迟和周期性重复执行任务的线程池</li>
</ul>
</div>
</div>
