src/jcip/executor.org
** Executor生命周期：运行，关闭中，终止

   #+BEGIN_SRC java
     public interface ExecutorService extends Executor {
             void shutdown();
             List<Runnable> shutdownNow();
             boolean isShutdown();
             boolean isTerminated();
             boolean awaitTermination(long timeout, TimeUnit unit)
                     throws InterruptedException;
     // ... additional convenience methods for task submission
     }
   #+END_SRC
- shutdown: 在关闭前允许执行以前提交的任务, 包括那些已提交但尚未开始执行的任务 
- shutdownNow: 阻止尚未开始执行的任务启动并试图停止当前正在执行的任务, 返回从未开始执行的任务的列表
- isShutdown：判断线程池是否已关闭. 线程池关闭后将拒绝接受新任务, 将抛出RejectedExecutionException
- awaitTermination: 将使得主线程阻塞, 直到线程池转变为终止状态, 通常在调用shutdown方法后紧接着调用awaitTermination方法
- isTerminated: 检测线程池是否处于终止状态, 当线程池已关闭, 并且所有提交给线程池的任务都已完成时, 线程池转变为终止状态


   #+BEGIN_SRC java
     class LifecycleWebServer {
             private final ExecutorService exec = ...;
             public void start() throws IOException {
                     ServerSocket socket = new ServerSocket(80);
                     while (!exec.isShutdown()) {
                             try {
                                     final Socket conn = socket.accept();
                                     exec.execute(new Runnable() {
                                                     public void run() { handleRequest(conn); }
                                             });
                             } catch (RejectedExecutionException e) {
                                     if (!exec.isShutdown())
                                             log("task submission rejected", e);
                             }
                     }
             }
             public void stop() { exec.shutdown(); }
             void handleRequest(Socket connection) {
                     Request req = readRequest(connection);
                     if (isShutdownRequest(req))
                             stop();
                     else
                             dispatchRequest(req);
             }
     }
   #+END_SRC

** Timer和ScheduledThreadPool 
两者都可以用于延时或周期性重复执行某个任务, 但是Timer存在一些缺陷:
1. Timer基于绝对时间来安排任务的调度, 因此系统时钟的改变会对其产生影响. ScheduledThreadPoolExecutor基于相对时间进行任务的调度
2. Timer创建单一的线程执行定时任务. 假如Timer对象以10ms的间隔重复执行某个任务, 但是其中的一次执行花去了40ms, 这就意味着少执行了至少4次重复任务. ScheduledThreadPoolExecutor可以使用多个线程执行定时任务
3. 如果在执行任务的过程中抛出运行时异常, Timer的线程会被终止且没有恢复机制
几乎没有理由继续使用Timer调度定时任务了

* 发现可利用的并发

