html/jcip/executor.html

<div id="outline-container-org8140dff" class="outline-3">
<h3 id="org8140dff">Executor生命周期：运行，关闭中，终止</h3>
<div class="outline-text-3" id="text-org8140dff">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">interface</span> <span style="color: #98f5ff;">ExecutorService</span> <span style="color: #00bfff; font-weight: bold;">extends</span> <span style="color: #98f5ff;">Executor</span> {
    <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">shutdown</span>();
    <span style="color: #98f5ff;">List</span>&lt;<span style="color: #98f5ff;">Runnable</span>&gt; <span style="color: #daa520; font-weight: bold;">shutdownNow</span>();
    <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">isShutdown</span>();
    <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">isTerminated</span>();
    <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">awaitTermination</span>(<span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">timeout</span>, <span style="color: #98f5ff;">TimeUnit</span> <span style="color: #4eee94;">unit</span>)
        <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">InterruptedException</span>;
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">... additional convenience methods for task submission</span>
}
</pre>
</div>
<ul class="org-ul">
<li>shutdown: 在关闭前允许执行以前提交的任务, 包括那些已提交但尚未开始执行的任务</li>
<li>shutdownNow: 阻止尚未开始执行的任务启动并试图停止当前正在执行的任务, 返回从未开始执行的任务的列表</li>
<li>isShutdown：判断线程池是否已关闭. 线程池关闭后将拒绝接受新任务, 将抛出RejectedExecutionException</li>
<li>awaitTermination: 将使得主线程阻塞, 直到线程池转变为终止状态, 通常在调用shutdown方法后紧接着调用awaitTermination方法</li>
<li>isTerminated: 检测线程池是否处于终止状态, 当线程池已关闭, 并且所有提交给线程池的任务都已完成时, 线程池转变为终止状态</li>
</ul>


<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">LifecycleWebServer</span> {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">ExecutorService</span> <span style="color: #4eee94;">exec</span> = ...;
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">start</span>() <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">IOException</span> {
        <span style="color: #98f5ff;">ServerSocket</span> <span style="color: #4eee94;">socket</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">ServerSocket</span>(80);
        <span style="color: #00bfff; font-weight: bold;">while</span> (!exec.isShutdown()) {
            <span style="color: #00bfff; font-weight: bold;">try</span> {
                <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Socket</span> <span style="color: #4eee94;">conn</span> = socket.accept();
                exec.execute(<span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Runnable</span>() {
                        <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">run</span>() { handleRequest(conn); }
                    });
            } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">RejectedExecutionException</span> <span style="color: #4eee94;">e</span>) {
                <span style="color: #00bfff; font-weight: bold;">if</span> (!exec.isShutdown())
                    log(<span style="color: #deb887;">"task submission rejected"</span>, e);
            }
        }
    }
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">stop</span>() { exec.shutdown(); }
    <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">handleRequest</span>(<span style="color: #98f5ff;">Socket</span> <span style="color: #4eee94;">connection</span>) {
        <span style="color: #98f5ff;">Request</span> <span style="color: #4eee94;">req</span> = readRequest(connection);
        <span style="color: #00bfff; font-weight: bold;">if</span> (isShutdownRequest(req))
            stop();
        <span style="color: #00bfff; font-weight: bold;">else</span>
            dispatchRequest(req);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org43dacfb" class="outline-3">
<h3 id="org43dacfb">Timer和ScheduledThreadPool</h3>
<div class="outline-text-3" id="text-org43dacfb">
<p>
两者都可以用于延时或周期性重复执行某个任务, 但是Timer存在一些缺陷:
</p>
<ol class="org-ol">
<li>Timer基于绝对时间来安排任务的调度, 因此系统时钟的改变会对其产生影响. ScheduledThreadPoolExecutor基于相对时间进行任务的调度</li>
<li>Timer创建单一的线程执行定时任务. 假如Timer对象以10ms的间隔重复执行某个任务, 但是其中的一次执行花去了40ms, 这就意味着少执行了至少4次重复任务. ScheduledThreadPoolExecutor可以使用多个线程执行定时任务</li>
<li>如果在执行任务的过程中抛出运行时异常, Timer的线程会被终止且没有恢复机制</li>
</ol>
<p>
几乎没有理由继续使用Timer调度定时任务了
</p>
</div>
</div>
</div>
