src/jcip/executor.org
** 返回结果的任务　
Executor的使用Runnable作为基本的任务表达形式，但是Runnable无法返回结果或抛出异常

Callable作为Runnable的扩展，可以返回结果或抛出异常
#+BEGIN_SRC java
  public interface Callable<V> {
          V call() throws Exception;
  }
#+END_SRC
Executor提交的任务有４个生命周期：创建，提交，开始和完成

已经提交但尚未开始的任务可以取消，已经开始执行但尚未完成的任务只有它们能响应中断才能取消，取消一个已经完成的任务没有任何影响

Future表示一个任务的生命周期，并提供相应的方法判断任务是否已经开始，完成，取消，以及获取任务结果，取消任务等
#+BEGIN_SRC java
  public interface Future<V> {
          boolean cancel(boolean mayInterruptIfRunning);
          boolean isCancelled();
          boolean isDone();
          V get() throws InterruptedException, ExecutionException,
                  CancellationException;
          V get(long timeout, TimeUnit unit)
                  throws InterruptedException, ExecutionException,
                  CancellationException, TimeoutException;
  }
#+END_SRC
get方法的行为取决与任务的状态
- 已经完成：立即返回结果或者抛出异常ExecutionException, 可以通过getClause获得被封装的初始异常
- 没有完成：阻塞主线程直到任务结束
- 取消：将抛出CancellationException

创建Future
+ ExecutorService中所有submit方法都会返回一个Future, 将Runnable或Callable提交给Executor得到Future
+ 也可以显式地为Runnable或者Callable创建一个FutureTask提交给Executor
+ ExecutorService也可以使用newTaskFor方法为Callable获得Future
#+BEGIN_SRC java
  protected <T> RunnableFuture<T> newTaskFor(Callable<T> task) {
          return new FutureTask<T>(task);
  }
#+END_SRC

使用Future渲染图片
#+BEGIN_SRC java
  public class FutureRenderer implements Render {
          private static final int NTHREADS = 100;
          private final ExecutorService executor = Executors.newFixedThreadPool(NTHREADS);

          @Override
          public void renderPage(CharSequence source) {
                  final List<ImageInfo> imageInfos = scanForImageInfo(source);
                  Callable<List<ImageData>> task;
                  task = () -> {
                          List<ImageData> result
                          = new ArrayList<>();
                          imageInfos.forEach((imageInfo) -> {
                                          result.add(imageInfo.downloadImage());
                                  });
                          return result;
                  };
                  Future<List<ImageData>> future = executor.submit(task);
                  // 渲染文本  
                  renderText(source);
                  try {
                          // get方法将阻塞, 直到task完成下载  
                          List<ImageData> imageData = future.get();
                          imageData.forEach((data) -> {
                                          // 渲染图片  
                                          renderImage(data);
                                  });
                  } catch (InterruptedException e) {
                          // Re-assert the thread’s interrupted status
                          Thread.currentThread().interrupt();
                          // We don’t need the result, so cancel the task too
                          future.cancel(true);
                  } catch (ExecutionException e) {
                          throw launderThrowable(e.getCause());
                  }
          }
  }
#+END_SRC

下载图片任务比渲染文本任务慢的多，可以把下载图片拆分成多个任务
