html/jcip/executor.html

<div id="outline-container-orgba2c938" class="outline-2">
<h2 id="orgba2c938">发现可利用的并发</h2>
<div class="outline-text-2" id="text-orgba2c938">
</div>
<div id="outline-container-org6189085" class="outline-3">
<h3 id="org6189085">返回结果的任务　</h3>
<div class="outline-text-3" id="text-org6189085">
<p>
Executor的使用Runnable作为基本的任务表达形式，但是Runnable无法返回结果或抛出异常
</p>

<p>
Callable作为Runnable的扩展，可以返回结果或抛出异常
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">interface</span> <span style="color: #98f5ff;">Callable</span>&lt;<span style="color: #98f5ff;">V</span>&gt; {
    <span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">call</span>() <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">Exception</span>;
}
</pre>
</div>
<p>
Executor提交的任务有４个生命周期：创建，提交，开始和完成
</p>

<p>
已经提交但尚未开始的任务可以取消，已经开始执行但尚未完成的任务只有它们能响应中断才能取消，取消一个已经完成的任务没有任何影响
</p>

<p>
Future表示一个任务的生命周期，并提供相应的方法判断任务是否已经开始，完成，取消，以及获取任务结果，取消任务等
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">interface</span> <span style="color: #98f5ff;">Future</span>&lt;<span style="color: #98f5ff;">V</span>&gt; {
    <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">cancel</span>(<span style="color: #98f5ff;">boolean</span> <span style="color: #4eee94;">mayInterruptIfRunning</span>);
    <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">isCancelled</span>();
    <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">isDone</span>();
    <span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">get</span>() <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">InterruptedException</span>, <span style="color: #98f5ff;">ExecutionException</span>,
        <span style="color: #98f5ff;">CancellationException</span>;
    <span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">get</span>(<span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">timeout</span>, <span style="color: #98f5ff;">TimeUnit</span> <span style="color: #4eee94;">unit</span>)
        <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">InterruptedException</span>, <span style="color: #98f5ff;">ExecutionException</span>,
        <span style="color: #98f5ff;">CancellationException</span>, <span style="color: #98f5ff;">TimeoutException</span>;
}
</pre>
</div>
<p>
get方法的行为取决与任务的状态
</p>
<ul class="org-ul">
<li>已经完成：立即返回结果或者抛出异常ExecutionException, 可以通过getClause获得被封装的初始异常</li>
<li>没有完成：阻塞主线程直到任务结束</li>
<li>取消：将抛出CancellationException</li>
</ul>

<p>
创建Future
</p>
<ul class="org-ul">
<li>ExecutorService中所有submit方法都会返回一个Future, 将Runnable或Callable提交给Executor得到Future</li>
<li>也可以显式地为Runnable或者Callable创建一个FutureTask提交给Executor</li>
<li>ExecutorService也可以使用newTaskFor方法为Callable获得Future</li>
</ul>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">protected</span> &lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #98f5ff;">RunnableFuture</span>&lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #daa520; font-weight: bold;">newTaskFor</span>(<span style="color: #98f5ff;">Callable</span>&lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #4eee94;">task</span>) {
    <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">FutureTask</span>&lt;<span style="color: #98f5ff;">T</span>&gt;(task);
}
</pre>
</div>

<p>
使用Future渲染图片
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">FutureRenderer</span> <span style="color: #00bfff; font-weight: bold;">implements</span> <span style="color: #98f5ff;">Render</span> {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">NTHREADS</span> = 100;
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">ExecutorService</span> <span style="color: #4eee94;">executor</span> = Executors.newFixedThreadPool(NTHREADS);

    <span style="color: #ffd700;">@Override</span>
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">renderPage</span>(<span style="color: #98f5ff;">CharSequence</span> <span style="color: #4eee94;">source</span>) {
        <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">List</span>&lt;<span style="color: #98f5ff;">ImageInfo</span>&gt; <span style="color: #4eee94;">imageInfos</span> = scanForImageInfo(source);
        <span style="color: #98f5ff;">Callable</span>&lt;<span style="color: #98f5ff;">List</span>&lt;<span style="color: #98f5ff;">ImageData</span>&gt;&gt; <span style="color: #4eee94;">task</span>;
        task = () -&gt; {
            <span style="color: #98f5ff;">List</span>&lt;<span style="color: #98f5ff;">ImageData</span>&gt; result
            = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">ArrayList</span>&lt;&gt;();
            imageInfos.forEach((imageInfo) -&gt; {
                    result.add(imageInfo.downloadImage());
                });
            <span style="color: #00bfff; font-weight: bold;">return</span> result;
        };
        <span style="color: #98f5ff;">Future</span>&lt;<span style="color: #98f5ff;">List</span>&lt;<span style="color: #98f5ff;">ImageData</span>&gt;&gt; <span style="color: #4eee94;">future</span> = executor.submit(task);
        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#28210;&#26579;&#25991;&#26412;  </span>
        renderText(source);
        <span style="color: #00bfff; font-weight: bold;">try</span> {
            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">get&#26041;&#27861;&#23558;&#38459;&#22622;, &#30452;&#21040;task&#23436;&#25104;&#19979;&#36733;  </span>
            <span style="color: #98f5ff;">List</span>&lt;<span style="color: #98f5ff;">ImageData</span>&gt; <span style="color: #4eee94;">imageData</span> = future.get();
            imageData.forEach((data) -&gt; {
                    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#28210;&#26579;&#22270;&#29255;  </span>
                    renderImage(data);
                });
        } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">InterruptedException</span> <span style="color: #4eee94;">e</span>) {
            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Re-assert the thread&#8217;s interrupted status</span>
            Thread.currentThread().interrupt();
            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">We don&#8217;t need the result, so cancel the task too</span>
            future.cancel(<span style="color: #ffd700;">true</span>);
        } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">ExecutionException</span> <span style="color: #4eee94;">e</span>) {
            <span style="color: #00bfff; font-weight: bold;">throw</span> launderThrowable(e.getCause());
        }
    }
}
</pre>
</div>

<p>
下载图片任务比渲染文本任务慢的多，可以把下载图片拆分成多个任务
</p>
</div>
</div>
